xsession/openocd/svd/ti/tms320f28m35x_m3.svd
<?xml version='1.0' encoding='utf-8'?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xsi:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Texas Instruments</vendor>
  <vendorID>TI</vendorID>
  <name>TMS320F28M35x_M3</name>
  <series>C2000 Concerto F28M35x</series>
  <version>0.2.0-generated</version>
  <description>Generated from TI CCS targetdb file f28m35m52c1.xml. Review against the TI technical reference manual before production use.</description>
  <licenseText>Generated metadata follows the license of the source TI files. Generator code is MIT licensed.</licenseText>
  <cpu>
    <name>CM3</name>
    <revision>r2p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>DEVEMU</name>
      <description>DEV EMU REGS Registers</description>
      <groupName>DEVEMU</groupName>
      <baseAddress>0x00000880</baseAddress>
      <registers>
        <register>
          <name>DEVICECNF</name>
          <description>Device Configuration Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>PARTID</name>
          <description>Device ID Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>REVID</name>
          <description>Revision Register</description>
          <addressOffset>0x00000003</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CCNF0</name>
          <description>C28 Peripheral Configuration 0</description>
          <addressOffset>0x00000006</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CCNF1</name>
          <description>C28 Peripheral Configuration 1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CCNF2</name>
          <description>C28 Peripheral Configuration 2</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CCNF3</name>
          <description>C28 Peripheral Configuration 3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CCNF4</name>
          <description>C28 Peripheral Configuration 4</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MEMCNF</name>
          <description>M3 Memory Configuartion Register</description>
          <addressOffset>0x00000046</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CSM</name>
      <description>DCSM REGS Registers</description>
      <groupName>CSM</groupName>
      <baseAddress>0x00000AE0</baseAddress>
      <registers>
        <register>
          <name>Z1_CSMKEY0</name>
          <description>CSMKEY0 Register for C28X-Zone-1 security Zone</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY1</name>
          <description>CSMKEY1 Register for C28X-Zone-1 security Zone</description>
          <addressOffset>0x00000002</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY2</name>
          <description>CSMKEY2 Register for C28X-Zone-1 security Zone</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY3</name>
          <description>CSMKEY3 Register for C28X-Zone-1 security Zone</description>
          <addressOffset>0x00000006</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CR</name>
          <description>Status and Control Register for C28X-Zone-1 security Zone</description>
          <addressOffset>0x0000000F</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLKEY0</name>
          <description>ECSLKEY0 Register for C28X-Zone-1 security Zone</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLKEY1</name>
          <description>ECSLKEY1 Register for C28X-Zone-1 security Zone</description>
          <addressOffset>0x00000012</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_EXEONLYR</name>
          <description>Execute-Only Select Register for flash sectors</description>
          <addressOffset>0x00000015</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
