xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA Registers</description>
      <groupName>DMA</groupName>
      <baseAddress>0x00001000</baseAddress>
      <registers>
        <register>
          <name>DMACTRL</name>
          <description>DMA Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DEBUGCTRL</name>
          <description>Debug Control Register</description>
          <addressOffset>0x00000001</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>REVISION</name>
          <description>Peripheral Revision Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PRIORITYCTRL1</name>
          <description>Priority Control Register 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PRIORITYSTAT</name>
          <description>Priority Status Register</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_MODE</name>
          <description>DMA Channel 1 Mode Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_CONTROL</name>
          <description>DMA Channel 1 Control Register</description>
          <addressOffset>0x00000021</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_BURST_SIZE</name>
          <description>DMA Channel 1 Burst Size Register</description>
          <addressOffset>0x00000022</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_BURST_COUNT</name>
          <description>DMA Channel 1 Burst Count Register</description>
          <addressOffset>0x00000023</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_BURST_STEP</name>
          <description>DMA Channel 1 Source Burst Step Size Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_BURST_STEP</name>
          <description>DMA Channel 1 Destination Burst Step Size Register</description>
          <addressOffset>0x00000025</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_TRANSFER_SIZE</name>
          <description>DMA Channel 1 Transfer Size Register</description>
          <addressOffset>0x00000026</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_TRANSFER_COUNT</name>
          <description>DMA Channel 1 Transfer Count Register</description>
          <addressOffset>0x00000027</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 1 Source Transfer Step Size Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_TRANSFER_STEP</name>
          <description>DMA Channel 1 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000029</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_WRAP_SIZE</name>
          <description>DMA Channel 1 Source Wrap Size Register</description>
          <addressOffset>0x0000002A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_WRAP_COUNT</name>
          <description>DMA Channel 1 Source Wrap Count Register</description>
          <addressOffset>0x0000002B</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_WRAP_STEP</name>
          <description>DMA Channel 1 Source Wrap Step Size Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_WRAP_SIZE</name>
          <description>DMA Channel 1 Destination Wrap Size Register</description>
          <addressOffset>0x0000002D</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_WRAP_COUNT</name>
          <description>DMA Channel 1 Destination Wrap Count Register</description>
          <addressOffset>0x0000002E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_WRAP_STEP</name>
          <description>DMA Channel 1 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000002F</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Source Begin Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Source Current Address Register</description>
          <addressOffset>0x00000032</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Source Begin Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Source Current Address Register</description>
          <addressOffset>0x00000036</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Destination Begin Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_ADDR_SHADOW</name>
          <description>DMA Channel 1 Shadow Destination Current Address Register</description>
          <addressOffset>0x0000003A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Destination Begin Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH1_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 1 Active Destination Current Address Register</description>
          <addressOffset>0x0000003E</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_MODE</name>
          <description>DMA Channel 2 Mode Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_CONTROL</name>
          <description>DMA Channel 2 Control Register</description>
          <addressOffset>0x00000041</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_BURST_SIZE</name>
          <description>DMA Channel 2 Burst Size Register</description>
          <addressOffset>0x00000042</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_BURST_COUNT</name>
          <description>DMA Channel 2 Burst Count Register</description>
          <addressOffset>0x00000043</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_BURST_STEP</name>
          <description>DMA Channel 2 Source Burst Step Size Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_BURST_STEP</name>
          <description>DMA Channel 2 Destination Burst Step Size Register</description>
          <addressOffset>0x00000045</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_TRANSFER_SIZE</name>
          <description>DMA Channel 2 Transfer Size Register</description>
          <addressOffset>0x00000046</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_TRANSFER_COUNT</name>
          <description>DMA Channel 2 Transfer Count Register</description>
          <addressOffset>0x00000047</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 2 Source Transfer Step Size Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_TRANSFER_STEP</name>
          <description>DMA Channel 2 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000049</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_WRAP_SIZE</name>
          <description>DMA Channel 2 Source Wrap Size Register</description>
          <addressOffset>0x0000004A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_WRAP_COUNT</name>
          <description>DMA Channel 2 Source Wrap Count Register</description>
          <addressOffset>0x0000004B</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_WRAP_STEP</name>
          <description>DMA Channel 2 Source Wrap Step Size Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_WRAP_SIZE</name>
          <description>DMA Channel 2 Destination Wrap Size Register</description>
          <addressOffset>0x0000004D</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_WRAP_COUNT</name>
          <description>DMA Channel 2 Destination Wrap Count Register</description>
          <addressOffset>0x0000004E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_WRAP_STEP</name>
          <description>DMA Channel 2 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000004F</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Source Begin Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Source Current Address Register</description>
          <addressOffset>0x00000052</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Source Begin Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Source Current Address Register</description>
          <addressOffset>0x00000056</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Destination Begin Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_ADDR_SHADOW</name>
          <description>DMA Channel 2 Shadow Destination Current Address Register</description>
          <addressOffset>0x0000005A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Destination Begin Register</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH2_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 2 Active Destination Current Address Register</description>
          <addressOffset>0x0000005E</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_MODE</name>
          <description>DMA Channel 3 Mode Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_CONTROL</name>
          <description>DMA Channel 3 Control Register</description>
          <addressOffset>0x00000061</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_BURST_SIZE</name>
          <description>DMA Channel 3 Burst Size Register</description>
          <addressOffset>0x00000062</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_BURST_COUNT</name>
          <description>DMA Channel 3 Burst Count Register</description>
          <addressOffset>0x00000063</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_BURST_STEP</name>
          <description>DMA Channel 3 Source Burst Step Size Register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_BURST_STEP</name>
          <description>DMA Channel 3 Destination Burst Step Size Register</description>
          <addressOffset>0x00000065</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_TRANSFER_SIZE</name>
          <description>DMA Channel 3 Transfer Size Register</description>
          <addressOffset>0x00000066</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_TRANSFER_COUNT</name>
          <description>DMA Channel 3 Transfer Count Register</description>
          <addressOffset>0x00000067</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 3 Source Transfer Step Size Register</description>
          <addressOffset>0x00000068</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_TRANSFER_STEP</name>
          <description>DMA Channel 3 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000069</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_WRAP_SIZE</name>
          <description>DMA Channel 3 Source Wrap Size Register</description>
          <addressOffset>0x0000006A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_WRAP_COUNT</name>
          <description>DMA Channel 3 Source Wrap Count Register</description>
          <addressOffset>0x0000006B</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
