xsession/openocd/svd/ti/tms320f28m35x_m3.svd
        <register>
          <name>DMACH3_SRC_WRAP_STEP</name>
          <description>DMA Channel 3 Source Wrap Step Size Register</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_WRAP_SIZE</name>
          <description>DMA Channel 3 Destination Wrap Size Register</description>
          <addressOffset>0x0000006D</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_WRAP_COUNT</name>
          <description>DMA Channel 3 Destination Wrap Count Register</description>
          <addressOffset>0x0000006E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_WRAP_STEP</name>
          <description>DMA Channel 3 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000006F</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Source Begin Register</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Source Current Address Register</description>
          <addressOffset>0x00000072</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Source Begin Register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Source Current Address Register</description>
          <addressOffset>0x00000076</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Destination Begin Register</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_ADDR_SHADOW</name>
          <description>DMA Channel 3 Shadow Destination Current Address Register</description>
          <addressOffset>0x0000007A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Destination Begin Register</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH3_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 3 Active Destination Current Address Register</description>
          <addressOffset>0x0000007E</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_MODE</name>
          <description>DMA Channel 4 Mode Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_CONTROL</name>
          <description>DMA Channel 4 Control Register</description>
          <addressOffset>0x00000081</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_BURST_SIZE</name>
          <description>DMA Channel 4 Burst Size Register</description>
          <addressOffset>0x00000082</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_BURST_COUNT</name>
          <description>DMA Channel 4 Burst Count Register</description>
          <addressOffset>0x00000083</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_BURST_STEP</name>
          <description>DMA Channel 4 Source Burst Step Size Register</description>
          <addressOffset>0x00000084</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_BURST_STEP</name>
          <description>DMA Channel 4 Destination Burst Step Size Register</description>
          <addressOffset>0x00000085</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_TRANSFER_SIZE</name>
          <description>DMA Channel 4 Transfer Size Register</description>
          <addressOffset>0x00000086</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_TRANSFER_COUNT</name>
          <description>DMA Channel 4 Transfer Count Register</description>
          <addressOffset>0x00000087</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 4 Source Transfer Step Size Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_TRANSFER_STEP</name>
          <description>DMA Channel 4 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000089</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_WRAP_SIZE</name>
          <description>DMA Channel 4 Source Wrap Size Register</description>
          <addressOffset>0x0000008A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_WRAP_COUNT</name>
          <description>DMA Channel 4 Source Wrap Count Register</description>
          <addressOffset>0x0000008B</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_WRAP_STEP</name>
          <description>DMA Channel 4 Source Wrap Step Size Register</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_WRAP_SIZE</name>
          <description>DMA Channel 4 Destination Wrap Size Register</description>
          <addressOffset>0x0000008D</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_WRAP_COUNT</name>
          <description>DMA Channel 4 Destination Wrap Count Register</description>
          <addressOffset>0x0000008E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_WRAP_STEP</name>
          <description>DMA Channel 4 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000008F</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Source Begin Register</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Source Current Address Register</description>
          <addressOffset>0x00000092</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Source Begin Register</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Source Current Address Register</description>
          <addressOffset>0x00000096</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Destination Begin Register</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_ADDR_SHADOW</name>
          <description>DMA Channel 4 Shadow Destination Current Address Register</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Destination Begin Register</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH4_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 4 Active Destination Current Address Register</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_MODE</name>
          <description>DMA Channel 5 Mode Register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_CONTROL</name>
          <description>DMA Channel 5 Control Register</description>
          <addressOffset>0x000000A1</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_BURST_SIZE</name>
          <description>DMA Channel 5 Burst Size Register</description>
          <addressOffset>0x000000A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_BURST_COUNT</name>
          <description>DMA Channel 5 Burst Count Register</description>
          <addressOffset>0x000000A3</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_BURST_STEP</name>
          <description>DMA Channel 5 Source Burst Step Size Register</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_BURST_STEP</name>
          <description>DMA Channel 5 Destination Burst Step Size Register</description>
          <addressOffset>0x000000A5</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_TRANSFER_SIZE</name>
          <description>DMA Channel 5 Transfer Size Register</description>
          <addressOffset>0x000000A6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_TRANSFER_COUNT</name>
          <description>DMA Channel 5 Transfer Count Register</description>
          <addressOffset>0x000000A7</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 5 Source Transfer Step Size Register</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_TRANSFER_STEP</name>
          <description>DMA Channel 5 Destination Transfer Step Size Register</description>
          <addressOffset>0x000000A9</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_WRAP_SIZE</name>
          <description>DMA Channel 5 Source Wrap Size Register</description>
          <addressOffset>0x000000AA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_WRAP_COUNT</name>
          <description>DMA Channel 5 Source Wrap Count Register</description>
          <addressOffset>0x000000AB</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_WRAP_STEP</name>
          <description>DMA Channel 5 Source Wrap Step Size Register</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_WRAP_SIZE</name>
          <description>DMA Channel 5 Destination Wrap Size Register</description>
          <addressOffset>0x000000AD</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_WRAP_COUNT</name>
          <description>DMA Channel 5 Destination Wrap Count Register</description>
          <addressOffset>0x000000AE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_WRAP_STEP</name>
          <description>DMA Channel 5 Destination Wrap Step Size Register</description>
          <addressOffset>0x000000AF</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Source Begin Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Source Current Address Register</description>
          <addressOffset>0x000000B2</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Source Begin Register</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Source Current Address Register</description>
          <addressOffset>0x000000B6</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Destination Begin Register</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_ADDR_SHADOW</name>
          <description>DMA Channel 5 Shadow Destination Current Address Register</description>
          <addressOffset>0x000000BA</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Destination Begin Register</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH5_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 5 Active Destination Current Address Register</description>
          <addressOffset>0x000000BE</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_MODE</name>
          <description>DMA Channel 6 Mode Register</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_CONTROL</name>
          <description>DMA Channel 6 Control Register</description>
          <addressOffset>0x000000C1</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_BURST_SIZE</name>
          <description>DMA Channel 6 Burst Size Register</description>
          <addressOffset>0x000000C2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_BURST_COUNT</name>
          <description>DMA Channel 6 Burst Count Register</description>
          <addressOffset>0x000000C3</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_BURST_STEP</name>
          <description>DMA Channel 6 Source Burst Step Size Register</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
