xsession/openocd/svd/ti/tms320f28m35x_m3.svd
        <register>
          <name>DMACH6_DST_BURST_STEP</name>
          <description>DMA Channel 6 Destination Burst Step Size Register</description>
          <addressOffset>0x000000C5</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_TRANSFER_SIZE</name>
          <description>DMA Channel 6 Transfer Size Register</description>
          <addressOffset>0x000000C6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_TRANSFER_COUNT</name>
          <description>DMA Channel 6 Transfer Count Register</description>
          <addressOffset>0x000000C7</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 6 Source Transfer Step Size Register</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_TRANSFER_STEP</name>
          <description>DMA Channel 6 Destination Transfer Step Size Register</description>
          <addressOffset>0x000000C9</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_WRAP_SIZE</name>
          <description>DMA Channel 6 Source Wrap Size Register</description>
          <addressOffset>0x000000CA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_WRAP_COUNT</name>
          <description>DMA Channel 6 Source Wrap Count Register</description>
          <addressOffset>0x000000CB</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_WRAP_STEP</name>
          <description>DMA Channel 6 Source Wrap Step Size Register</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_WRAP_SIZE</name>
          <description>DMA Channel 6 Destination Wrap Size Register</description>
          <addressOffset>0x000000CD</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_WRAP_COUNT</name>
          <description>DMA Channel 6 Destination Wrap Count Register</description>
          <addressOffset>0x000000CE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_WRAP_STEP</name>
          <description>DMA Channel 6 Destination Wrap Step Size Register</description>
          <addressOffset>0x000000CF</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Source Begin Register</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Source Current Address Register</description>
          <addressOffset>0x000000D2</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Source Begin Register</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Source Current Address Register</description>
          <addressOffset>0x000000D6</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Destination Begin Register</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Destination Current Address Register</description>
          <addressOffset>0x000000DA</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Destination Begin Register</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Destination Current Address Register</description>
          <addressOffset>0x000000DE</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>RSVD1</name>
          <description>Reserved</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
