xsession/openocd/svd/ti/tms320f28m35x_m3.svd
        <register>
          <name>CMPBM</name>
          <description>Counter Compare B Mirror Register</description>
          <addressOffset>0x00000067</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPC</name>
          <description>Counter Compare C Register</description>
          <addressOffset>0x00000069</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPD</name>
          <description>Counter Compare D Register</description>
          <addressOffset>0x0000006B</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBREDHR</name>
          <description>Dead-Band Generator Rising Edge Delay High Resolution Mirror Register</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBREDM</name>
          <description>Dead-Band Generator Rising Edge Delay Count Mirror Register</description>
          <addressOffset>0x0000006D</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBFEDHR</name>
          <description>Dead-Band Generator Falling Edge Delay High Resolution Register</description>
          <addressOffset>0x0000006E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBFEDM</name>
          <description>Dead-Band Generator Falling Edge Delay Count Register</description>
          <addressOffset>0x0000006F</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ETCLRM</name>
          <description>Event Trigger Clear Register</description>
          <addressOffset>0x00000070</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TZCLRM</name>
          <description>Trip Zone Clear Register</description>
          <addressOffset>0x00000071</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQCTLAM</name>
          <description>Action Qualifier Control Register For Output A</description>
          <addressOffset>0x00000073</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQCTLBM</name>
          <description>Action Qualifier Control Register For Output B</description>
          <addressOffset>0x00000074</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQSFRCM</name>
          <description>Action Qualifier Software Force Register</description>
          <addressOffset>0x00000075</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQCSFRCM</name>
          <description>Action Qualifier Continuous S/W Force Register</description>
          <addressOffset>0x00000076</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ECAP1</name>
      <description>eCAP Control and Status Registers</description>
      <groupName>ECAP</groupName>
      <baseAddress>0x00005A00</baseAddress>
      <registers>
        <register>
          <name>TSCTR</name>
          <description>eCAP Time-Stamp Counter</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CTRPHS</name>
          <description>eCAP Counter Phase Offset Value Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAP1</name>
          <description>eCAP Capture 1 Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAP2</name>
          <description>eCAP Capture 2 Register</description>
          <addressOffset>0x00000006</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAP3</name>
          <description>eCAP Capture 3 Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAP4</name>
          <description>eCAP Capture 4 Register</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>ECCTL1</name>
          <description>eCAP Capture Control Register 1</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ECCTL2</name>
          <description>eCAP Capture Control Register 2</description>
          <addressOffset>0x00000015</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ECEINT</name>
          <description>eCAP Capture Interrupt Enable Register</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ECFLG</name>
          <description>eCAP Capture Interrupt Flag Register</description>
          <addressOffset>0x00000017</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ECCLR</name>
          <description>eCAP Capture Interrupt Clear Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ECFRC</name>
          <description>eCAP Capture Interrupt Force Register</description>
          <addressOffset>0x00000019</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
