xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOG1CTRL</name>
      <description>GPIOG1 CTRL REGS Registers</description>
      <groupName>GPIOG1CTRL</groupName>
      <baseAddress>0x00005F80</baseAddress>
      <registers>
        <register>
          <name>GPACTRL</name>
          <description>GPIO A Control Register (GPIO0 to 31)</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPAQSEL1</name>
          <description>GPIO A Qualifier Select 1 Register (GPIO0 to 15)</description>
          <addressOffset>0x00000002</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPAQSEL2</name>
          <description>GPIO A Qualifier Select 2 Register (GPIO16 to 31)</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPAMUX1</name>
          <description>GPIO A Mux 1 Register (GPIO0 to 15)</description>
          <addressOffset>0x00000006</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPAMUX2</name>
          <description>GPIO A Mux 2 Register (GPIO16 to 31)</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPADIR</name>
          <description>GPIO A Direction Register (GPIO0 to 31) )</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBCTRL</name>
          <description>GPIO B Control Register (GPIO32 to 63)</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBQSEL1</name>
          <description>GPIO B Qualifier Select 1 Register (GPIO32 to 47)</description>
          <addressOffset>0x00000012</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBQSEL2</name>
          <description>GPIO B Qualifier Select 2 Register (GPIO48 to 63)</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBMUX1</name>
          <description>GPIO B Mux 1 Register (GPIO32 to 47)</description>
          <addressOffset>0x00000016</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBMUX2</name>
          <description>GPIO B Mux 2 Register (GPIO48 to 63)</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBDIR</name>
          <description>GPIO B Direction Register (GPIO32 to 63)</description>
          <addressOffset>0x0000001A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCCTRL</name>
          <description>GPIO C Control Register (GPIO68 to 71)</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCQSEL1</name>
          <description>GPIO C Qualifier Select 1 Register (GPIO68 to 71)</description>
          <addressOffset>0x00000022</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCMUX1</name>
          <description>GPIO C Mux 1 Register (GPIO68 to 71)</description>
          <addressOffset>0x00000026</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCDIR</name>
          <description>GPIO C Direction Register (GPIO68 to 71)</description>
          <addressOffset>0x0000002A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOG1DAT</name>
      <description>GPIOG1 DATA REGS Registers</description>
      <groupName>GPIOG1DAT</groupName>
      <baseAddress>0x00005FC0</baseAddress>
      <registers>
        <register>
          <name>GPADAT</name>
          <description>GPIO A Data Register (GPIO0 to 31)</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPASET</name>
          <description>GPIO A Data Set Register (GPIO0 to 31)</description>
          <addressOffset>0x00000002</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPACLEAR</name>
          <description>GPIO A Data Clear Register (GPIO0 to 31)</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPATOGGLE</name>
          <description>GPIO A Data Toggle Register (GPIO0 to 31)</description>
          <addressOffset>0x00000006</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBDAT</name>
          <description>GPIO B Data Register (GPIO32 to 63)</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBSET</name>
          <description>GPIO B Data Set Register (GPIO32 to 63)</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBCLEAR</name>
          <description>GPIO B Data Clear Register (GPIO32 to 63)</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPBTOGGLE</name>
          <description>GPIO B Data Toggle Register (GPIO32 to 63)</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCDAT</name>
          <description>GPIO C Data Register (GPIO68 to 71)</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCSET</name>
          <description>GPIO C Data Set Register (GPIO68 to 71)</description>
          <addressOffset>0x00000012</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCCLEAR</name>
          <description>GPIO C Data Clear Register (GPIO32 to 63)</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPCTOGGLE</name>
          <description>GPIO C Data Toggle Register (GPIO32 to 63)</description>
          <addressOffset>0x00000016</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
