xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x00006420</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP3</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x00006440</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP4</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x00006460</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP5</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x00006480</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP6</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x000064A0</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
