xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOG2CTRL</name>
      <description>GPIOG2 CTRL REGS Registers</description>
      <groupName>GPIOG2CTRL</groupName>
      <baseAddress>0x00006F80</baseAddress>
      <registers>
        <register>
          <name>GPECTRL</name>
          <description>GPIO E Control Register (GPIO128 to 135)</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPEQSEL1</name>
          <description>GPIO E Qualifier Select 1 Register (GPIO128 to 135)</description>
          <addressOffset>0x00000002</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPEMUX1</name>
          <description>GPIO E Mux 1 Register (GPIO128 to 135)</description>
          <addressOffset>0x00000006</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPEDIR</name>
          <description>GPIO E Direction Register (GPIO128 to 135 )</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPEPUD</name>
          <description>GPEPUD register for (GPIO128 to 135)</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>AIOMUX1</name>
          <description>Analog IO Mux 1 Register (AIO0-15)</description>
          <addressOffset>0x00000036</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>AIOMUX2</name>
          <description>Analog IO Mux 2 Register (AIO16-31)</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>AIODIR</name>
          <description>Analog IO Direction Register (AIO0-31)</description>
          <addressOffset>0x0000003A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOG2DAT</name>
      <description>GPIOG2 DATA REGS Registers</description>
      <groupName>GPIOG2DAT</groupName>
      <baseAddress>0x00006FC0</baseAddress>
      <registers>
        <register>
          <name>GPEDAT</name>
          <description>GPIO E Data Register (GPIO128 to 135)</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPESET</name>
          <description>GPIO E Data Set Register (GPIO128 to 135)</description>
          <addressOffset>0x00000002</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPECLEAR</name>
          <description>GPIO E Data Clear Register (GPIO128 to 135)</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPETOGGLE</name>
          <description>GPIO E Data Toggle Register (GPIO128 to 135)</description>
          <addressOffset>0x00000006</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>AIODAT</name>
          <description>Analog IO Data Register (AIO0 to 31)</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>AIOSET</name>
          <description>Analog IO Data Set Register (AIO0 to 31)</description>
          <addressOffset>0x0000001A</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>AIOCLEAR</name>
          <description>Analog IO Data Clear Register (AIO0 to 31)</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>AIOTOGGLE</name>
          <description>Analog IO Data Toggle Register (AIO0 to 31)</description>
          <addressOffset>0x0000001E</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
