xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT1</name>
      <description>WDT REGS Registers</description>
      <groupName>WDT</groupName>
      <baseAddress>0x40001000</baseAddress>
      <registers>
        <register>
          <name>WDTLOAD</name>
          <description>Watchdog Load</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTVALUE</name>
          <description>Watchdog Value</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTICR</name>
          <description>Watchdog Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTRIS</name>
          <description>Watchdog Raw Interrupt Status</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTMIS</name>
          <description>Watchdog Masked Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTTEST</name>
          <description>Watchdog Test</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTLOCK</name>
          <description>Watchdog Lock</description>
          <addressOffset>0x00000C00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID4</name>
          <description>Watchdog Peripheral Identification 4</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID5</name>
          <description>Watchdog Peripheral Identification 5</description>
          <addressOffset>0x00000FD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID6</name>
          <description>Watchdog Peripheral Identification 6</description>
          <addressOffset>0x00000FD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID7</name>
          <description>Watchdog Peripheral Identification 7</description>
          <addressOffset>0x00000FDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID0</name>
          <description>Watchdog Peripheral Identification 0</description>
          <addressOffset>0x00000FE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID1</name>
          <description>Watchdog Peripheral Identification 1</description>
          <addressOffset>0x00000FE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID2</name>
          <description>Watchdog Peripheral Identification 2</description>
          <addressOffset>0x00000FE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPERIPHID3</name>
          <description>Watchdog Peripheral Identification 3</description>
          <addressOffset>0x00000FEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPCELLID0</name>
          <description>Watchdog PrimeCell Identification 0</description>
          <addressOffset>0x00000FF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPCELLID1</name>
          <description>Watchdog PrimeCell Identification 1</description>
          <addressOffset>0x00000FF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPCELLID2</name>
          <description>Watchdog PrimeCell Identification 2</description>
          <addressOffset>0x00000FF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>WDTPCELLID3</name>
          <description>Watchdog PrimeCell Identification 3</description>
          <addressOffset>0x00000FFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
