xsession/openocd/svd/ti/tms320f28m35x_m3.svd
        <register>
          <name>USB_TXFUNCADDR8</name>
          <description>USB Transmit Functional Address Endpoint 8</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR8_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR8</name>
          <description>USB Transmit Hub Address Endpoint 8</description>
          <addressOffset>0x000000C2</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR8_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR8_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT8</name>
          <description>USB Transmit Hub Port Endpoint 8</description>
          <addressOffset>0x000000C3</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT8_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR8</name>
          <description>USB Receive Functional Address Endpoint 8</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR8_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR8</name>
          <description>USB Receive Hub Address Endpoint 8</description>
          <addressOffset>0x000000C6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR8_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR8_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT8</name>
          <description>USB Receive Hub Port Endpoint 8</description>
          <addressOffset>0x000000C7</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT8_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR9</name>
          <description>USB Transmit Functional Address Endpoint 9</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR9_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR9</name>
          <description>USB Transmit Hub Address Endpoint 9</description>
          <addressOffset>0x000000CA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR9_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR9_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT9</name>
          <description>USB Transmit Hub Port Endpoint 9</description>
          <addressOffset>0x000000CB</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT9_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR9</name>
          <description>USB Receive Functional Address Endpoint 9</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR9_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR9</name>
          <description>USB Receive Hub Address Endpoint 9</description>
          <addressOffset>0x000000CE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR9_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR9_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT9</name>
          <description>USB Receive Hub Port Endpoint 9</description>
          <addressOffset>0x000000CF</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT9_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR10</name>
          <description>USB Transmit Functional Address Endpoint 10</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR10_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR10</name>
          <description>USB Transmit Hub Address Endpoint 10</description>
          <addressOffset>0x000000D2</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR10_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR10_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT10</name>
          <description>USB Transmit Hub Port Endpoint 10</description>
          <addressOffset>0x000000D3</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT10_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR10</name>
          <description>USB Receive Functional Address Endpoint 10</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR10_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR10</name>
          <description>USB Receive Hub Address Endpoint 10</description>
          <addressOffset>0x000000D6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR10_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR10_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT10</name>
          <description>USB Receive Hub Port Endpoint 10</description>
          <addressOffset>0x000000D7</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT10_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR11</name>
          <description>USB Transmit Functional Address Endpoint 11</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR11_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR11</name>
          <description>USB Transmit Hub Address Endpoint 11</description>
          <addressOffset>0x000000DA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR11_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR11_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT11</name>
          <description>USB Transmit Hub Port Endpoint 11</description>
          <addressOffset>0x000000DB</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT11_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR11</name>
          <description>USB Receive Functional Address Endpoint 11</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR11_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR11</name>
          <description>USB Receive Hub Address Endpoint 11</description>
          <addressOffset>0x000000DE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR11_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR11_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT11</name>
          <description>USB Receive Hub Port Endpoint 11</description>
          <addressOffset>0x000000DF</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT11_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR12</name>
          <description>USB Transmit Functional Address Endpoint 12</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR12_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR12</name>
          <description>USB Transmit Hub Address Endpoint 12</description>
          <addressOffset>0x000000E2</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR12_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR12_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT12</name>
          <description>USB Transmit Hub Port Endpoint 12</description>
          <addressOffset>0x000000E3</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT12_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR12</name>
          <description>USB Receive Functional Address Endpoint 12</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR12_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR12</name>
          <description>USB Receive Hub Address Endpoint 12</description>
          <addressOffset>0x000000E6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR12_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR12_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT12</name>
          <description>USB Receive Hub Port Endpoint 12</description>
          <addressOffset>0x000000E7</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT12_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR13</name>
          <description>USB Transmit Functional Address Endpoint 13</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR13_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
