xsession/openocd/svd/ti/tms320f28m35x_m3.svd
        <register>
          <name>USB_TXHUBADDR13</name>
          <description>USB Transmit Hub Address Endpoint 13</description>
          <addressOffset>0x000000EA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR13_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR13_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT13</name>
          <description>USB Transmit Hub Port Endpoint 13</description>
          <addressOffset>0x000000EB</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT13_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR13</name>
          <description>USB Receive Functional Address Endpoint 13</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR13_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR13</name>
          <description>USB Receive Hub Address Endpoint 13</description>
          <addressOffset>0x000000EE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR13_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR13_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT13</name>
          <description>USB Receive Hub Port Endpoint 13</description>
          <addressOffset>0x000000EF</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT13_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR14</name>
          <description>USB Transmit Functional Address Endpoint 14</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR14_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR14</name>
          <description>USB Transmit Hub Address Endpoint 14</description>
          <addressOffset>0x000000F2</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR14_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR14_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT14</name>
          <description>USB Transmit Hub Port Endpoint 14</description>
          <addressOffset>0x000000F3</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT14_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR14</name>
          <description>USB Receive Functional Address Endpoint 14</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR14_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR14</name>
          <description>USB Receive Hub Address Endpoint 14</description>
          <addressOffset>0x000000F6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR14_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR14_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT14</name>
          <description>USB Receive Hub Port Endpoint 14</description>
          <addressOffset>0x000000F7</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT14_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR15</name>
          <description>USB Transmit Functional Address Endpoint 15</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR15_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR15</name>
          <description>USB Transmit Hub Address Endpoint 15</description>
          <addressOffset>0x000000FA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR15_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR15_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT15</name>
          <description>USB Transmit Hub Port Endpoint 15</description>
          <addressOffset>0x000000FB</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT15_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR15</name>
          <description>USB Receive Functional Address Endpoint 15</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR15_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR15</name>
          <description>USB Receive Hub Address Endpoint 15</description>
          <addressOffset>0x000000FE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR15_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR15_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT15</name>
          <description>USB Receive Hub Port Endpoint 15</description>
          <addressOffset>0x000000FF</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT15_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <addressOffset>0x00000102</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_CSRL0_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_DATAEND</name>
              <description>Data End</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_SETUP</name>
              <description>Setup Packet</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_ERROR</name>
              <description>Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_SETEND</name>
              <description>Setup End</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_REQPKT</name>
              <description>Request Packet</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_STALL</name>
              <description>Send Stall</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_RXRDYC</name>
              <description>RXRDY Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_STATUS</name>
              <description>STATUS Packet</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRL0_SETENDC</name>
              <description>Setup End Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CSRH0</name>
          <description>USB Control and Status Endpoint 0 High</description>
          <addressOffset>0x00000103</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_CSRH0_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRH0_DT</name>
              <description>Data Toggle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CSRH0_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_COUNT0</name>
          <description>USB Receive Byte Count Endpoint 0</description>
          <addressOffset>0x00000108</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_COUNT0_COUNT</name>
              <description>FIFO Count</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TYPE0</name>
          <description>USB Type Endpoint 0</description>
          <addressOffset>0x0000010A</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TYPE0_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_NAKLMT</name>
          <description>USB NAK Limit</description>
          <addressOffset>0x0000010B</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_NAKLMT_NAKLMT</name>
              <description>EP0 NAK Limit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXMAXP1</name>
          <description>USB Maximum Transmit Data Endpoint 1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
