xsession/openocd/svd/ti/tms320f28m35x_m3.svd
        <register>
          <name>USB_TXCSRH10</name>
          <description>USB Transmit Control and Status Endpoint 10 High</description>
          <addressOffset>0x000001A3</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRH10_DT</name>
              <description>Data Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH10_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH10_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH10_FDT</name>
              <description>Force Data Toggle</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH10_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH10_MODE</name>
              <description>Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH10_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH10_AUTOSET</name>
              <description>Auto Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP10</name>
          <description>USB Maximum Receive Data Endpoint 10</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXMAXP10_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL10</name>
          <description>USB Receive Control and Status Endpoint 10 Low</description>
          <addressOffset>0x000001A6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRL10_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_FULL</name>
              <description>FIFO Full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_OVER</name>
              <description>Overrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_DATAERR</name>
              <description>Data Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_REQPKT</name>
              <description>Request Packet</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_STALL</name>
              <description>Send STALL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL10_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH10</name>
          <description>USB Receive Control and Status Endpoint 10 High</description>
          <addressOffset>0x000001A7</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRH10_DT</name>
              <description>Data Toggle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_DISNYET</name>
              <description>Disable NYET</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_PIDERR</name>
              <description>PID Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_AUTORQ</name>
              <description>Auto Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH10_AUTOCL</name>
              <description>Auto Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT10</name>
          <description>USB Receive Byte Count Endpoint 10</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCOUNT10_COUNT</name>
              <description>Receive Packet Count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE10</name>
          <description>USB Host Transmit Configure Type Endpoint 10</description>
          <addressOffset>0x000001AA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXTYPE10_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE10_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE10_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE10_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE10_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL10</name>
          <description>USB Host Transmit Interval Endpoint 10</description>
          <addressOffset>0x000001AB</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXINTERVAL10_TXPOLL</name>
              <description>TX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXTYPE10</name>
          <description>USB Host Configure Receive Type Endpoint 10</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXTYPE10_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE10_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE10_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE10_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE10_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL10</name>
          <description>USB Host Receive Polling Interval Endpoint 10</description>
          <addressOffset>0x000001AD</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXINTERVAL10_TXPOLL</name>
              <description>RX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXMAXP11</name>
          <description>USB Maximum Transmit Data Endpoint 11</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXMAXP11_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL11</name>
          <description>USB Transmit Control and Status Endpoint 11 Low</description>
          <addressOffset>0x000001B2</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRL11_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_UNDRN</name>
              <description>Underrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_SETUP</name>
              <description>Setup Packet</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_STALL</name>
              <description>Send STALL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL11_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH11</name>
          <description>USB Transmit Control and Status Endpoint 11 High</description>
          <addressOffset>0x000001B3</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRH11_DT</name>
              <description>Data Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH11_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH11_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH11_FDT</name>
              <description>Force Data Toggle</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH11_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH11_MODE</name>
              <description>Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH11_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH11_AUTOSET</name>
              <description>Auto Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP11</name>
          <description>USB Maximum Receive Data Endpoint 11</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXMAXP11_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
