xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_PORTD_AHB</name>
      <description>GPIO REGS Registers</description>
      <groupName>GPIO_PORTD_AHB</groupName>
      <baseAddress>0x4005B000</baseAddress>
      <registers>
        <register>
          <name>GPIODATA</name>
          <description>GPIO Data</description>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIODIR</name>
          <description>GPIO Direction</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIS</name>
          <description>GPIO Interrupt Sense</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIBE</name>
          <description>GPIO Interrupt Both Edges</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIEV</name>
          <description>GPIO Interrupt Event</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIM</name>
          <description>GPIO Interrupt Mask</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIORIS</name>
          <description>GPIO Raw Interrupt Status</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOMIS</name>
          <description>GPIO Masked Interrupt Status</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOICR</name>
          <description>GPIO Interrupt Clear</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOAFSEL</name>
          <description>GPIO Alternate Function Select</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOODR</name>
          <description>GPIO Open Drain Select</description>
          <addressOffset>0x0000050C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPUR</name>
          <description>GPIO Pull-Up Select</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIODEN</name>
          <description>GPIO Digital Enable</description>
          <addressOffset>0x0000051C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOLOCK</name>
          <description>GPIO Lock</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCR</name>
          <description>GPIO Commit</description>
          <addressOffset>0x00000524</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOAMSEL</name>
          <description>GPIO Analog Mode Select</description>
          <addressOffset>0x00000528</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPCTL</name>
          <description>GPIO Port Control</description>
          <addressOffset>0x0000052C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOAPSEL</name>
          <description>GPIO Alternate Port Select</description>
          <addressOffset>0x00000530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCSEL</name>
          <description>GPIO Core Select</description>
          <addressOffset>0x00000534</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID4</name>
          <description>GPIO Peripheral Identification 4</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID5</name>
          <description>GPIO Peripheral Identification 5</description>
          <addressOffset>0x00000FD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID6</name>
          <description>GPIO Peripheral Identification 6</description>
          <addressOffset>0x00000FD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID7</name>
          <description>GPIO Peripheral Identification 7</description>
          <addressOffset>0x00000FDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID0</name>
          <description>GPIO Peripheral Identification 0</description>
          <addressOffset>0x00000FE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID1</name>
          <description>GPIO Peripheral Identification 1</description>
          <addressOffset>0x00000FE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID2</name>
          <description>GPIO Peripheral Identification 2</description>
          <addressOffset>0x00000FE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID3</name>
          <description>GPIO Peripheral Identification 3</description>
          <addressOffset>0x00000FEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID0</name>
          <description>GPIO PrimeCell Identification 0</description>
          <addressOffset>0x00000FF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID1</name>
          <description>GPIO PrimeCell Identification 1</description>
          <addressOffset>0x00000FF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID2</name>
          <description>GPIO PrimeCell Identification 2</description>
          <addressOffset>0x00000FF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID3</name>
          <description>GPIO PrimeCell Identification 3</description>
          <addressOffset>0x00000FFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
