xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN1</name>
      <description>CAN REGS Registers</description>
      <groupName>CAN</groupName>
      <baseAddress>0x40074000</baseAddress>
      <registers>
        <register>
          <name>CAN_CTL</name>
          <description>CAN Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_ES</name>
          <description>CAN Error and Status Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_ERRC</name>
          <description>CAN Error Counter Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_BTR</name>
          <description>CAN Bit Timing Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_INT</name>
          <description>CAN Interrupt Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_TEST</name>
          <description>CAN Test Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_PERR</name>
          <description>CAN Parity Error Code Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_ABOTR</name>
          <description>CAN Auto-bus-on Time Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_TXRQ</name>
          <description>CAN Transmission Request 2_1 Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_NWDAT</name>
          <description>CAN New Data 2_1 Register</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_INTPND</name>
          <description>CAN Interrupt Pending 2_1 Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_MSGVAL</name>
          <description>CAN Message Valid 2_1 Register</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_INTMUX</name>
          <description>CAN Interrupt Multiplexer 2_1 Register</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF1CMD</name>
          <description>CAN Interface 1 Command Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF1MSK</name>
          <description>CAN Interface 1 Mask Register</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF1ARB</name>
          <description>CAN Interface 1 Arbitration Register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF1MCTL</name>
          <description>CAN Interface 1 Message Control Register</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF1DATA</name>
          <description>CAN Interface 1 DATA A2_A1 Register</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF1DATB</name>
          <description>CAN Interface 1 DATA B2_B1 Register</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF2CMD</name>
          <description>CAN Interface 2 Command Register</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF2MSK</name>
          <description>CAN Interface 2 Mask Register</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF2ARB</name>
          <description>CAN Interface 2 Arbitration Register</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF2MCTL</name>
          <description>CAN Interface 2 Message Control Register</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF2DATA</name>
          <description>CAN Interface 2 DATA A2_A1 Register</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF2DATB</name>
          <description>CAN Interface 2 DATA B2_B1 Register</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF3OBS</name>
          <description>CAN Interface 3 Observation Register</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF3MSK</name>
          <description>CAN Interface 3 Mask Register</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF3ARB</name>
          <description>CAN Interface 3 Arbitration Register</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF3MCTL</name>
          <description>CAN Interface 3 Message Control Register</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF3DATA</name>
          <description>CAN Interface 3 DATA A2_A1 Register</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF3DATB</name>
          <description>CAN Interface 3 DATA B2_B1 Register</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CAN_IF3UPD</name>
          <description>CAN Interface 3 Update Enable 2_1 Register</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
