xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCSM</name>
      <description>DCSM REGS Registers</description>
      <groupName>DCSM</groupName>
      <baseAddress>0x400FB400</baseAddress>
      <registers>
        <register>
          <name>Z1_CSMKEY0</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY1</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY2</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY3</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLKEY0</name>
          <description>ECSLKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLKEY1</name>
          <description>ECSLKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY0</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY1</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY2</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY3</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_ECSLKEY0</name>
          <description>ECSLKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_ECSLKEY1</name>
          <description>ECSLKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMLOCKSR</name>
          <description>Locked Status Register for CSM passwords of M3-Zone-1 security Zone</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLLOCKSR</name>
          <description>Locked Status Register for ECSL passwords of M3-Zone-1 security Zone</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMLOCKSR</name>
          <description>Locked Status Register for CSM passwords of M3-Zone-2 security Zone</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_ECSLLOCKSR</name>
          <description>Locked Status Register for ECSL passwords of M3-Zone-2 security Zone</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CR</name>
          <description>Status and Control Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CR</name>
          <description>Status and Control Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_GRABSECTR</name>
          <description>Grab Flash-Sectors Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_GRABRAMR</name>
          <description>Grab RAM-blocks Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_GRABSECTR</name>
          <description>Grab Flash-Sectors Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_GRABRAMR</name>
          <description>Grab RAM-blocks Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_EXEONLYR</name>
          <description>Execute-Only Select Register for flash sectors mapped to M3-Zone-1 security Zone</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_EXEONLYR</name>
          <description>Execute-Only Select Register for flash sectors mapped to M3-Zone-2 security Zone</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
