xsession/openocd/svd/ti/tms320f28m35x_m3.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COREPERIPH</name>
      <description>M3 CORE PERIPHERALS Registers</description>
      <groupName>COREPERIPH</groupName>
      <baseAddress>0xE000E000</baseAddress>
      <registers>
        <register>
          <name>NVIC_INT_TYPE</name>
          <description>Interrupt Controller Type Reg</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_CTRL</name>
          <description>SysTick Control and Status Reg</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_RELOAD</name>
          <description>SysTick Reload Value Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_CURRENT</name>
          <description>SysTick Current Value Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_CAL</name>
          <description>SysTick Calibration Value Reg</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN0</name>
          <description>IRQ 0 to 31 Set Enable Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN1</name>
          <description>IRQ 32 to 63 Set Enable Register</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN2</name>
          <description>IRQ 64 to 95 Set Enable Register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN3</name>
          <description>IRQ 96 to 127 Set Enable Register</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN4</name>
          <description>IRQ 128 to 133 Set Enable Register</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS0</name>
          <description>IRQ 0 to 31 Clear Enable Reg</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS1</name>
          <description>IRQ 32 to 63 Clear Enable Reg</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS2</name>
          <description>IRQ 64 to 95 Clear Enable Reg</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS3</name>
          <description>IRQ 96 to 127 Clear Enable Reg</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS4</name>
          <description>IRQ 128 to 133 Clear Enable Reg</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND0</name>
          <description>IRQ 0 to 31 Set Pending Register</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND1</name>
          <description>IRQ 32 to 63 Set Pending Reg</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND2</name>
          <description>IRQ 64 to 95 Set Pending Reg</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND3</name>
          <description>IRQ 96 to 127 Set Pending Reg</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND4</name>
          <description>IRQ 128 to 133 Set Pending Reg</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND0</name>
          <description>IRQ 0 to 31 Clear Pending Reg</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND1</name>
          <description>IRQ 32 to 63 Clear Pending Reg</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND2</name>
          <description>IRQ 64 to 95 Clear Pending Reg</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND3</name>
          <description>IRQ 96 to 127 Clear Pending Reg</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND4</name>
          <description>IRQ 128 to 133 Clear Pending Reg</description>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE0</name>
          <description>IRQ 0 to 31 Active Register</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE1</name>
          <description>IRQ 32 to 63 Active Register</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE2</name>
          <description>IRQ 64 to 95 Active Register</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE3</name>
          <description>IRQ 96 to 127 Active Register</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE4</name>
          <description>IRQ 128 to 133 Active Register</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI0</name>
          <description>IRQ 0 to 3 Priority Register</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI1</name>
          <description>IRQ 4 to 7 Priority Register</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI2</name>
          <description>IRQ 8 to 11 Priority Register</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI3</name>
          <description>IRQ 12 to 15 Priority Register</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI4</name>
          <description>IRQ 16 to 19 Priority Register</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI5</name>
          <description>IRQ 20 to 23 Priority Register</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI6</name>
          <description>IRQ 24 to 27 Priority Register</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI7</name>
          <description>IRQ 28 to 31 Priority Register</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI8</name>
          <description>IRQ 32 to 35 Priority Register</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI9</name>
          <description>IRQ 36 to 39 Priority Register</description>
          <addressOffset>0x00000424</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI10</name>
          <description>IRQ 40 to 43 Priority Register</description>
          <addressOffset>0x00000428</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI11</name>
          <description>IRQ 44 to 47 Priority Register</description>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI12</name>
          <description>IRQ 48 to 51 Priority Register</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI13</name>
          <description>IRQ 52 to 55 Priority Register</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI14</name>
          <description>IRQ 56 to 59 Priority Register</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI15</name>
          <description>IRQ 60 to 63 Priority Register</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI16</name>
          <description>IRQ 64 to 67 Priority Register</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI17</name>
          <description>IRQ 68 to 71 Priority Register</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI18</name>
          <description>IRQ 72 to 75 Priority Register</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI19</name>
          <description>IRQ 76 to 79 Priority Register</description>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI20</name>
          <description>IRQ 80 to 83 Priority Register</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI21</name>
          <description>IRQ 84 to 87 Priority Register</description>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI22</name>
          <description>IRQ 88 to 91 Priority Register</description>
          <addressOffset>0x00000458</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI23</name>
          <description>IRQ 92 to 95 Priority Register</description>
          <addressOffset>0x0000045C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI24</name>
          <description>IRQ 96 to 99 Priority Register</description>
          <addressOffset>0x00000460</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI25</name>
          <description>IRQ 100 to 103 Priority Register</description>
          <addressOffset>0x00000464</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI26</name>
          <description>IRQ 104 to 107 Priority Register</description>
          <addressOffset>0x00000468</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI27</name>
          <description>IRQ 108 to 111 Priority Register</description>
          <addressOffset>0x0000046C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI28</name>
          <description>IRQ 112 to 115 Priority Register</description>
          <addressOffset>0x00000470</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI29</name>
          <description>IRQ 116 to 119 Priority Register</description>
          <addressOffset>0x00000474</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI30</name>
          <description>IRQ 120 to 123 Priority Register</description>
          <addressOffset>0x00000478</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI31</name>
          <description>IRQ 124 to 127 Priority Register</description>
          <addressOffset>0x0000047C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI32</name>
          <description>IRQ 128 to 131 Priority Register</description>
          <addressOffset>0x00000480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI33</name>
          <description>IRQ 132 to 135 Priority Register</description>
          <addressOffset>0x00000484</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_CPUID</name>
          <description>CPUID Base Register</description>
          <addressOffset>0x00000D00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_INT_CTRL</name>
          <description>Interrupt Control State Register</description>
          <addressOffset>0x00000D04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_VTABLE</name>
          <description>Vector Table Offset Register</description>
          <addressOffset>0x00000D08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_APINT</name>
          <description>App. Int &amp; Reset Control Reg</description>
          <addressOffset>0x00000D0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
