xsession/openocd/svd/ti/tms320f28m35x_m3.svd
        <register>
          <name>SCB_SYS_CTRL</name>
          <description>System Control Register</description>
          <addressOffset>0x00000D10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_CFG_CTRL</name>
          <description>Configuration Control Register</description>
          <addressOffset>0x00000D14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_SYS_PRI1</name>
          <description>Sys. Handlers 4 to 7 Priority</description>
          <addressOffset>0x00000D18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_SYS_PRI2</name>
          <description>Sys. Handlers 8 to 11 Priority</description>
          <addressOffset>0x00000D1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_SYS_PRI3</name>
          <description>Sys. Handlers 12 to 15 Priority</description>
          <addressOffset>0x00000D20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_SYS_HND_CTRL</name>
          <description>System Handler Control and State</description>
          <addressOffset>0x00000D24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_FAULT_STAT</name>
          <description>Configurable Fault Status Reg</description>
          <addressOffset>0x00000D28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_HFAULT_STAT</name>
          <description>Hard Fault Status Register</description>
          <addressOffset>0x00000D2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DEBUG_STAT</name>
          <description>Debug Status Register</description>
          <addressOffset>0x00000D30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_MM_ADDR</name>
          <description>Mem Manage Address Register</description>
          <addressOffset>0x00000D34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_FAULT_ADDR</name>
          <description>Bus Fault Address Register</description>
          <addressOffset>0x00000D38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MPU_TYPE</name>
          <description>MPU Type Register</description>
          <addressOffset>0x00000D90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <description>MPU Control Register</description>
          <addressOffset>0x00000D94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MPU_NUMBER</name>
          <description>MPU Region Number Register</description>
          <addressOffset>0x00000D98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MPU_BASE</name>
          <description>MPU Region Base Address Register</description>
          <addressOffset>0x00000D9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MPU_ATTR</name>
          <description>MPU Region Attribute &amp; Size Reg</description>
          <addressOffset>0x00000DA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DEBUG_DBG_CTRL</name>
          <description>Debug Control and Status Reg</description>
          <addressOffset>0x00000DF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DEBUG_DBG_XFER</name>
          <description>Debug Core Reg. Transfer Select</description>
          <addressOffset>0x00000DF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DEBUG_DBG_DATA</name>
          <description>Debug Core Register Data</description>
          <addressOffset>0x00000DF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DEBUG_DBG_INT</name>
          <description>Debug Reset Interrupt Control</description>
          <addressOffset>0x00000DFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_SW_TRIG</name>
          <description>Software Trigger Interrupt Reg</description>
          <addressOffset>0x00000F00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <tiCore>CM3</tiCore>
    <tiAddressScale>1</tiAddressScale>
    <tiCortexDebugCompatible>true</tiCortexDebugCompatible>
    <tiProcessorName>cm3</tiProcessorName>
    <tiGenerator>ti-c2000-toolchain</tiGenerator>
  </vendorExtensions>
</device>